In [ ]:
import pandas as pd

In [2]:
data = {
    'Yil': [2021, 2020, 2019, 2018, 2017],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9],
    'Temp': [1.54, 1.48, 1.56, 1.62, 1.65]
}

In [3]:
df = pd.DataFrame(data)

In [7]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.columns

Index(['Yil', 'Aholi soni', 'Temp'], dtype='object')

In [10]:
indeks = df.columns

In [11]:
indeks

Index(['Yil', 'Aholi soni', 'Temp'], dtype='object')

In [12]:
'Temp' in indeks

True

In [13]:
indeks[0]

'Yil'

In [15]:
indeks[2:4]

Index(['Temp'], dtype='object')

In [17]:
df1w

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [28]:
usernames = {"nurmuhammad": '3030', "olim": 'olimtot40', "maryam": '3030mar'}
emails = {"nurmuhammad": 'mashrapov3030@gmail.com', 'olim': 'olim@gmail.com', "maryam": 'maryam@gmail.com'}
data = {
    'username':usernames,
    'email': emails
}
df = pd.DataFrame(data)

In [29]:
df

              username                    email
nurmuhammad       3030  mashrapov3030@gmail.com
olim         olimtot40           olim@gmail.com
maryam         3030mar         maryam@gmail.com

In [30]:
df.index

Index(['nurmuhammad', 'olim', 'maryam'], dtype='object')

In [37]:
data2 = {
    'username': {"muhammad": '3030', "olim": 'olimtot40'},
    'email': {"muhammad": 'mashrapov3030@gmail.com', 'olim': 'olim@gmail.com'}
}

In [38]:
df2 = df.append(pd.DataFrame(data2))

/tmp/ipykernel_7537/289703299.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df.append(pd.DataFrame(data2))

In [39]:
DF2

NameError: name 'DF2' is not defined

In [40]:
df2

              username                    email
nurmuhammad       3030  mashrapov3030@gmail.com
olim         olimtot40           olim@gmail.com
maryam         3030mar         maryam@gmail.com
muhammad          3030  mashrapov3030@gmail.com
olim         olimtot40           olim@gmail.com

In [41]:
newind = pd.Index(['olim', 'olimtot', 'hamida'])
newind

Index(['olim', 'olimtot', 'hamida'], dtype='object')

In [42]:
newind.isin(df2.index)

array([ True, False, False])

In [43]:
df2.index.difference(newind)

Index(['maryam', 'muhammad', 'nurmuhammad'], dtype='object')

In [44]:
newind.difference(df2.index)

Index(['hamida', 'olimtot'], dtype='object')

In [45]:
df2.index.union(newind)

Index(['hamida', 'maryam', 'muhammad', 'nurmuhammad', 'olim', 'olim',
       'olimtot'],
      dtype='object')

In [46]:
df2.index.delete(0)

Index(['olim', 'maryam', 'muhammad', 'olim'], dtype='object')

In [47]:
newind

Index(['olim', 'olimtot', 'hamida'], dtype='object')

In [48]:
newind.drop('hamida')

Index(['olim', 'olimtot'], dtype='object')

In [50]:
df2.index.unique

In [51]:
data = {
    'Yil': [2021, 2020, 2019, 2018, 2017],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9],
    'Temp': [1.54, 1.48, 1.56, 1.62, 1.65],
    'Zichlik':[79.77, 78.87, 77.53, 76.54, 75.22]
}
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.87
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.54
4  2017        31.9  1.65    75.22

In [52]:
df.index = [21,20,19,18,17]

In [53]:
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.87
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.54
17  2017        31.9  1.65    75.22

In [54]:
# Reindex

In [55]:
ind = [21,20,19,18,17]

In [56]:
ind.sort()

In [57]:
ind

[17, 18, 19, 20, 21]

In [58]:
df.reindex(ind)

     Yil  Aholi soni  Temp  Zichlik
17  2017        31.9  1.65    75.22
18  2018        32.5  1.62    76.54
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.87
21  2021        33.9  1.54    79.77

In [59]:
df.reindex(ind)

     Yil  Aholi soni  Temp  Zichlik
17  2017        31.9  1.65    75.22
18  2018        32.5  1.62    76.54
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.87
21  2021        33.9  1.54    79.77

In [60]:
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.87
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.54
17  2017        31.9  1.65    75.22

In [64]:
df.reindex(index=range(10,22), method='ffill')

     Yil  Aholi soni  Temp  Zichlik
10  2017        31.9  1.65    75.22
11  2017        31.9  1.65    75.22
12  2017        31.9  1.65    75.22
13  2017        31.9  1.65    75.22
14  2017        31.9  1.65    75.22
15  2017        31.9  1.65    75.22
16  2017        31.9  1.65    75.22
17  2017        31.9  1.65    75.22
18  2018        32.5  1.62    76.54
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.87
21  2021        33.9  1.54    79.77

In [65]:
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.87
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.54
17  2017        31.9  1.65    75.22

In [68]:
df2 = df.reindex(columns=['Aholi soni', 'Temp',
                                  'Zichlik'])

In [69]:
df2

    Aholi soni  Temp  Zichlik
21        33.9  1.54    79.77
20        33.5  1.48    78.87
19        32.9  1.56    77.53
18        32.5  1.62    76.54
17        31.9  1.65    75.22

In [70]:
df2.sample()

    Aholi soni  Temp  Zichlik
20        33.5  1.48    78.87

In [72]:
df.loc[[20, 19, 18], ['Aholi soni', 'Zichlik', 'Temp']]

    Aholi soni  Zichlik  Temp
20        33.5    78.87  1.48
19        32.9    77.53  1.56
18        32.5    76.54  1.62

In [73]:
df.drop(18)

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.87
19  2019        32.9  1.56    77.53
17  2017        31.9  1.65    75.22

In [76]:
df.drop('Yil', axis='columns')

    Aholi soni  Temp  Zichlik
21        33.9  1.54    79.77
20        33.5  1.48    78.87
19        32.9  1.56    77.53
18        32.5  1.62    76.54
17        31.9  1.65    75.22

In [77]:
df_new = df.drop('Yil', axis='columns')

In [78]:
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.87
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.54
17  2017        31.9  1.65    75.22

In [79]:
df.drop('Yil', axis='columns', inplace=True)

In [80]:
df

    Aholi soni  Temp  Zichlik
21        33.9  1.54    79.77
20        33.5  1.48    78.87
19        32.9  1.56    77.53
18        32.5  1.62    76.54
17        31.9  1.65    75.22